Repository: liang23333/asian-entrepreneur-mentorship
Catalog: translation-memory/mentorship-memory.tmx
Source language: en
Languages: hi, zh

source: GROW Mentorship Framework
hi: GROW मेंटरशिप फ्रेमवर्क
zh: GROW 导师指导框架

source: Goal (G) – Defining the Destination
hi: लक्ष्य (Goal - G) – मंजिल का निर्धारण
zh: 目标 (Goal, G) – 确立终点与愿景

source: Reality (R) – Assessing Current Ground Truth
hi: वास्तविकता (Reality - R) – वर्तमान स्थिति का वस्तुनिष्ठ मूल्यांकन
zh: 现状 (Reality, R) – 评估当下的客观事实

source: Options (O) – Exploring Possibilities & Pathways
hi: विकल्प (Options - O) – संभावनाओं और नए रास्तों की खोज
zh: 选择 (Options, O) – 拓展路径与多元可能

source: Will / Way Forward (W) – Committing to Action
hi: इच्छाशक्ति / आगे की राह (Will / Way Forward - W) – कार्रवाई की प्रतिबद्धता
zh: 意愿 / 行动方案 (Will / Way Forward, W) – 落实承诺与推进

source: Cash Runway
hi: कैश रनवे
zh: 现金流跑道

source: Customer Churn
hi: ग्राहक पलायन दर
zh: 客户流失率

source: Pivot
hi: दिशा परिवर्तन (Pivot)
zh: 业务转型 (Pivot)

source: Fear of losing face
hi: 'प्रतिष्ठा खोने' का भय
zh: 对“丢面子”的恐惧

source: De-stigmatizing Failure
hi: विफलता के कलंक को दूर करना
zh: 消除对失败的耻感

source: Parental and Generational Expectations
hi: पारिवारिक और पीढ़ीगत अपेक्षाएं
zh: 长辈与代际期望

source: Commitment Score
hi: प्रतिबद्धता स्कोर
zh: 承诺度评分
